local _, ns = ...

local LibBG = ns.LibBG
local L = ns.L

local pt = print

BG.Loot.blacklist = {}
BG.Loot.whitelist = {}
BG.Loot.zaXiangItems = {}
BG.Loot.stackItems = {}
BG.Loot.noStackItems = {}
BG.Loot.itemToBoss = {}
BG.Loot.itemPack = {}

if BG.IsVanilla then
    BG.Loot.blacklist = {
        -- 60/plus
        17413, 17414, 17682, 17683, 22393, 18600,                      -- 坚韧祷言、野性赐福、暗影防护、奥术光辉
        22727,                                                         -- 橙杖杖柄
        19708, 19713, 19715, 19711, 19710, 19712, 19707, 19714, 19709, -- ZUG蓝色宝石
        213169, 213170, 213641,                                        -- 白银血币、黄金血币、一箱诺莫瑞根回收品
        223327, 223325, 223326, 221474,                                -- plus神庙哈卡任务奖励的蓝装
    }
    BG.Loot.whitelist = {
        -- 60/plus
        -- 17962, 17963, 17964, 17965, 17969, -- [一袋宝石]
        21284, 21287, 21285, 21279, 21214, 21280, 21281, 21283, 21282, -- 废墟技能书
        21300, 21303, 21302, 21294, 21296, 21295, 21306, 21304, 21307,
        21291, 21292, 21293, 21288, 21289, 21290, 21298, 21299, 21297,
        17203,                                                      -- MC萨弗隆铁锭
        17204, 227728,                                              -- MC萨弗拉斯之眼
        -- 22376, 22373, 22374, 22375,                                 -- NAXX护甲碎片
        23055,                                                      -- NAXX溶解之语
        21762,                                                      -- AQL/TAQ大型圣甲虫箱的钥匙
        20873, 20869, 20866, 20870, 20868, 20871, 20867, 20872,     -- AQL小怪雕像
        20876, 20879, 20875, 20878, 20881, 20877, 20874, 20882,     -- AQL/TAQ大型圣甲虫箱开出的雕像
        16665,                                                      -- 宁神射击
        18562,                                                      -- [源质矿石]
        15410,                                                      -- [奥妮克希亚鳞片]
        17966, 228992,                                              -- [奥妮克希亚皮袋]
        11382,                                                      -- [山脉之血]
        17012,                                                      -- [熔火犬皮]
        17011,                                                      -- [熔岩之核]
        17010,                                                      -- [炽热之核]
        19939, 19942, 19940, 19941, 231513, 231514, 231515, 231516, -- ZUG隐藏boss掉落的职业物品
        213427,                                                     -- 脏兮兮的回收品
        215449,                                                     -- 世界缩小器
        221021, 221312,                                             -- 梦魇之种、一瓶阿塔莱魔精
        13519, 13522, 18657, 16247,                                 -- 黑上配方
        -- , -- []
        -- , -- []
    }
    BG.Loot.zaXiangItems = {
        -- 60/plus
        21237, 21232,                                                   -- 安其拉徽记和武器
        213427,                                                         -- 脏兮兮
        220637, 220636,                                                 -- plusP3套装兑换物
        221021, 221312,                                                 -- 梦魇之种、一瓶阿塔莱魔精
        221298, 221300, 221301, 221302, 221303, 221304, 221305, 221306, -- 梦魇卡牌
        221290, 221291, 221297, 221292, 221296, 221293, 221295, 221294, -- 沙丘卡牌
        221281, 221282, 221284, 221283, 221288, 221287, 221285, 221286, -- 瘟疫卡牌
        221271, 221275, 221273, 221279, 221274, 221278, 221276, 221277, -- 荒野卡牌
    }
    BG.Loot.stackItems = {}
elseif BG.IsTBC then
    BG.Loot.blacklist = {
        30312, 30311, 30317, 30316, 30313, 30314, 30318, 30319, 30320, 265069, 265070, -- 风暴要塞神器
        29549, 22146, 31837, 22153                                                     -- 坚韧祷言、野性赐福、暗影防护、奥术光辉
    }
    BG.Loot.whitelist = {
    }
    BG.Loot.zaXiangItems = { 30183 }
    BG.Loot.stackItems = {}
    BG.Loot.noStackItems = { 30183 }
elseif BG.IsWLK_80 then
    BG.Loot.blacklist = {
        49888,                                                                         -- 影锋
        48663, 230763,                                                                 -- 美酒节
        45875, 45878,                                                                  -- 一包奥杜尔战利品
        45897,                                                                         --[重铸的远古王者之锤]
        52006,                                                                         --[冰霜珍宝袋]
        51315, 51316, 51317, 51318, 51319, 51320, 51321,                               --[密封的箱子]相关物品
        69771, 54806, 225923,                                                          -- iLv353、232、225的埃霍恩的冰霜之镰
        30312, 30311, 30317, 30316, 30313, 30314, 30318, 30319, 30320, 265069, 265070, -- 风暴要塞神器
    }
    -- ICC声望戒指加入黑名单
    if BG.Loot.ICC then
        for i = 2, 5 do
            if BG.Loot.ICC.Faction["1156:" .. i] then
                for _, itemID in ipairs(BG.Loot.ICC.Faction["1156:" .. i]) do
                    tinsert(BG.Loot.blacklist, itemID)
                end
            end
        end
    end
    BG.Loot.whitelist = {
        50226, --[烂肠的酸性血液]
        50231, --[腐面的酸性血液]
        52019, -- 小宝的丝带
        45087, --[ULD宝珠]
        47556, --[TOC宝珠]
        49908, --[ICC宝珠]
        -- , -- []
        -- , -- []
    }
    BG.Loot.zaXiangItems = {
        50226,               --[烂肠的酸性血液]
        50231,               --[腐面的酸性血液]
        47242,               --  北伐
        47557, 47558, 47559, -- TOC258套装圣物
        37254,               -- 超级猴子球
    }
    -- ICC小怪掉落总是记录到杂项
    if BG.Loot.ICC then
        for _, itemID in pairs(BG.Loot.ICC.H25.boss14) do
            tinsert(BG.Loot.zaXiangItems, itemID)
        end
    end
elseif BG.IsTitan then
    BG.Loot.blacklist = {
        -- 时光服
        260344, 257606, 260346, -- 橙色项链
        264750, 264779, 264759, 264769,
        264751, 264780, 264760, 264770,
        264752, 264781, 264761, 264771,
        264753, 264782, 264762, 264772,
        264754, 264783, 264763, 264773,
        264755, 264784, 264764, 264774,
        264789, 264785, 264765, 264775,
        264756, 264786, 264766, 264776,
        264757, 264787, 264767, 264777,
        264758, 264788, 264768, 264778, -- 橙色项链
        255112, 255113,                 -- 猎人史诗弓
        255107, 255108,                 -- 祈福
        255102, 255090,                 -- 粪叉
        265841,                         -- 埃提耶什的缚魂碎片
        268132, 268152, 19785, 268151, 19788, 268130, 268129, 268131, 19789, 268155,
        268133, 268156, 19783, 268153, 268144, 268154, 268143, 20077, 20076, 20078,
        268174, 268541, 268542, 268543, 268544,                                        -- 祖格新附魔
        -- WLK
        49888,                                                                         -- 影锋
        48663, 230763,                                                                 -- 美酒节
        45875, 45878,                                                                  -- 一包奥杜尔战利品
        45897,                                                                         --[重铸的远古王者之锤]
        52006,                                                                         --[冰霜珍宝袋]
        51315, 51316, 51317, 51318, 51319, 51320, 51321,                               --[密封的箱子]相关物品
        69771, 54806, 225923,                                                          -- iLv353、232、225的埃霍恩的冰霜之镰
        30312, 30311, 30317, 30316, 30313, 30314, 30318, 30319, 30320, 265069, 265070, -- 风暴要塞神器
    }
    -- ICC声望戒指加入黑名单
    if BG.Loot.ICC then
        for i = 2, 5 do
            if BG.Loot.ICC.Faction["1156:" .. i] then
                for _, itemID in ipairs(BG.Loot.ICC.Faction["1156:" .. i]) do
                    tinsert(BG.Loot.blacklist, itemID)
                end
            end
        end
    end
    BG.Loot.whitelist = {
        -- 时光服
        17203,                                                                 -- MC萨弗隆铁锭
        260722, 260734, 260774, 260710,                                        -- MC蓝色附魔
        22739, 19914,                                                          -- [秘典：变形术：龟][豹皮背包]
        19939, 19940, 19941, 19942,                                            -- 祖格隐藏BOSS
        274994,                                                                -- [原始哈卡莱神像]
        19706, 19701, 19700, 19699, 19704, 19705, 19702, 19703, 19698,         -- 祖格绿色宝石
        19708, 19713, 19715, 19711, 19710, 19712, 19707, 19714, 19709,         -- 祖格蓝色宝石
        19943,                                                                 -- 极效魔精
        19820, 19818, 19819, 19814, 19821, 19816, 19817, 19815, 19813, 268145, -- 巫毒人偶
        -- WLK
        50226,                                                                 --[烂肠的酸性血液]
        50231,                                                                 --[腐面的酸性血液]
        52019,                                                                 -- 小宝的丝带
        45087,                                                                 --[ULD宝珠]
        47556,                                                                 --[TOC宝珠]
        49908,                                                                 --[ICC宝珠]
        -- , -- []
        -- , -- []
    }
    BG.Loot.zaXiangItems = {
        -- 时光服
        260703, 260712,                                                        -- MC通用掉落
        260722, 260734, 260774, 260710,                                        -- MC蓝色附魔
        30183,                                                                 -- 毒蛇风暴虚空漩涡
        265526, 265523, 265524,                                                -- NAXX的橙装升级物品
        22726,                                                                 -- NAXX新碎片
        52019,                                                                 -- 小宝的丝带
        267339, 267338, 267335, 267340,                                        -- P4的橙装升级物品
        272955,                                                                -- [艾瑞达之心]
        19914,                                                                 -- [豹皮背包]
        274994,                                                                -- [原始哈卡莱神像]
        47556,                                                                 -- 十字军宝珠
        19820, 19818, 19819, 19814, 19821, 19816, 19817, 19815, 19813, 268145, -- 巫毒人偶
        34334,                                                                 -- 橙弓
        -- WLK
        50226,                                                                 --[烂肠的酸性血液]
        50231,                                                                 --[腐面的酸性血液]
        47242,                                                                 -- 北伐
        37254,                                                                 -- 超级猴子球
    }
    -- 时光服TOC箱子记录到杂项
    if BG.IsAlliance then
        for _, itemID in ipairs({ 47506, 47526, 47517, 47519, 47521, 47524, 47515, 47547, 47545, 47549, 47552, 47553, 49096, }) do
            tinsert(BG.Loot.zaXiangItems, itemID)
        end
    else
        for _, itemID in ipairs({ 47513, 47528, 47518, 47520, 47523, 47525, 47516, 47548, 47546, 47550, 47551, 47554, 49098, }) do
            tinsert(BG.Loot.zaXiangItems, itemID)
        end
    end

    BG.Loot.stackItems = {
        -- 时光服
        22726,                                                                 -- NAXX新碎片
        19820, 19818, 19819, 19814, 19821, 19816, 19817, 19815, 19813, 268145, -- 巫毒人偶
    }
    BG.Loot.noStackItems = {
        47556, -- 十字军宝珠
    }
    BG.Loot.itemToBoss = {
        TOCtitan = {
            [19961] = 5, -- 隐藏BOSS
            [19962] = 5, -- 隐藏BOSS
            [19993] = 5, -- 隐藏BOSS
            [19965] = 5, -- 隐藏BOSS
            [19967] = 5, -- 隐藏BOSS
            [19968] = 5, -- 隐藏BOSS
            [19964] = 5, -- 隐藏BOSS
            [19963] = 5, -- 隐藏BOSS
            [19939] = 5, -- 隐藏BOSS
            [19941] = 5, -- 隐藏BOSS
            [19942] = 5, -- 隐藏BOSS
            [19940] = 5, -- 隐藏BOSS
            [22739] = 6, -- [秘典：变形术：龟]
        },
        SWtitan = {
            [33590] = 7, -- 限时宝箱
            [33591] = 7, -- 限时宝箱
            [33489] = 7, -- 限时宝箱
            [33480] = 7, -- 限时宝箱
            [33483] = 7, -- 限时宝箱
            [33971] = 7, -- 限时宝箱
            [33805] = 7, -- 限时宝箱
            [33481] = 7, -- 限时宝箱
            [33497] = 7, -- 限时宝箱
            [33500] = 7, -- 限时宝箱
            [33496] = 7, -- 限时宝箱
            [33499] = 7, -- 限时宝箱
            [33498] = 7, -- 限时宝箱
            [33495] = 7, -- 限时宝箱
            [33493] = 7, -- 限时宝箱
            [33492] = 7, -- 限时宝箱
            [33490] = 7, -- 限时宝箱
            [33494] = 7, -- 限时宝箱
            [33491] = 7, -- 限时宝箱
            [33809] = 7, -- 限时宝箱
        },
    }
    BG.Loot.itemPack = {
        -- 绿色宝石
        [19706] = 19706,
        [19701] = 19706,
        [19700] = 19706,
        [19699] = 19706,
        [19704] = 19706,
        [19705] = 19706,
        [19702] = 19706,
        [19703] = 19706,
        [19698] = 19706,
        -- 蓝色宝石
        [19708] = 19708,
        [19713] = 19708,
        [19715] = 19708,
        [19711] = 19708,
        [19710] = 19708,
        [19712] = 19708,
        [19707] = 19708,
        [19714] = 19708,
        [19709] = 19708,
        -- 巫毒人偶
        [19820] = 19820,
        [19818] = 19820,
        [19819] = 19820,
        [19814] = 19820,
        [19821] = 19820,
        [19816] = 19820,
        [19817] = 19820,
        [19815] = 19820,
        [19813] = 19820,
        [268145] = 19820,
    }

    BG.LootRenou = {
        [19820] = L['牧师人偶'],
        [19818] = L['法师人偶'],
        [19819] = L['术士人偶'],
        [19814] = L['盗贼人偶'],
        [19821] = L['德鲁伊人偶'],
        [19816] = L['猎人人偶'],
        [19817] = L['萨满人偶'],
        [19815] = L['圣骑士人偶'],
        [19813] = L['战士人偶'],
        [268145] = L['死亡骑士人偶'],
    }
elseif BG.IsCTM then
    BG.Loot.zaXiangItems = {
        -- CTM
        67424, 67423, 67425, 65087, 65088, 65089, 67430, 67429, 67431,
        67427, 67428, 67426, 65000, 65001, 65002, 64316, 64315, 64314,
        63684, 63683, 63682, -- P1套装兑换物
    }
elseif BG.IsMOP then
    BG.Loot.blacklist = {
        105745, 105747, 105743, 105748, 105744, 105741, 105746, 105742, -- [库卡隆黑暗萨满风帽]
        94867, 94594, 94593,                                            -- 雷神之核 泰坦符文石 帝国秘史
        87210, 87209, 87208,                                            -- 恐惧奇美拉、智慧印记、力量印记
        -- CTM
        77951,                                                          -- 暗影宝石
    }
    BG.Loot.whitelist = {
        77952, -- 巨龙之魂橙片
    }
    BG.Loot.zaXiangItems = {
        -- MOP
        105856, -- [战争的回响]
        -- CTM
        67424, 67423, 67425, 65087, 65088, 65089, 67430, 67429, 67431,
        67427, 67428, 67426, 65000, 65001, 65002, 64316, 64315, 64314,
        63684, 63683, 63682, -- P1套装兑换物
    }
    BG.Loot.stackItems = {}
elseif BG.IsRetail then
    BG.Loot.blacklist = {}
    BG.Loot.whitelist = {}
    BG.Loot.zaXiangItems = {}
    BG.Loot.stackItems = {}
end

local function FormatTable(tbl)
    local new = {}
    for _, itemID in ipairs(tbl) do
        new[itemID] = true
    end
    return new
end

for _, itemID in pairs(BG.Loot.noStackItems) do
    tinsert(BG.Loot.zaXiangItems, itemID)
end

BG.Loot.blacklist = FormatTable(BG.Loot.blacklist)
BG.Loot.whitelist = FormatTable(BG.Loot.whitelist)
BG.Loot.zaXiangItems = FormatTable(BG.Loot.zaXiangItems)
BG.Loot.stackItems = FormatTable(BG.Loot.stackItems)
BG.Loot.noStackItems = FormatTable(BG.Loot.noStackItems)
